{"active":false,"project_no":"EBLTD","title":"EB0-EBLTD-LANGSTON TERRACE","agency":"DEPUTY MAYOR FOR ECONOMIC DEVELOPMENT (EB0)","implementing_agency":"DEPUTY MAYOR FOR ECONOMIC DEVELOPMENT (EB0)","ward":"5","location":"21ST STREET & BENNING ROAD, NE","facility":"LANGSTON TERRACE","status":"0","description":"The funding would allow DMPED to assess the rehabilitation/redevelopment feasibility of the site. The property, owned and operated by DCHA, was the first public housing project in the District of Columbia and the second in the United States. As such it is a local and nationally designated historic landmark. The study would evaluate the development potential for the site by analyzing many factors --- some of these include current and potential zoning, transportation issues, potential massing on the site, potential public funding sources, market analyses and the impact of the site’s historic designation. Upon analysis of the site’s development potential, DMPED would be able to estimate the ancillary tax revenue benefits.","justification":"The funding would allow DMPED to assess the rehabilitation/redevelopment feasibility of the site. The property, owned and operated by DCHA, was the first public housing project in the District of Columbia and the second in the United States. As such, it is a local and nationally designated historic landmark.","progress_assessment":"Project has not begun.","related_projects":"DHCD (DB0) project 50305C provides funding for the reconfiguration and modest renovation of housing units at DCHA’s Langston Terrace housing site. Milestone Data Projected Actual Environmental Approvals Design Start (FY) Design Complete (FY) Construction Start (FY) Construction Complete (FY) Closeout (FY)","milestones":{"environmental_approvals":{},"design_start":{},"design_complete":{},"construction_start":{},"construction_complete":{},"closeout":{}},"lat":null,"lon":null,"first_year":2011,"last_year":2011,"cip_history":{"FY 2011":{"FY 2011":1000,"FY 2012":0,"FY 2013":0,"FY 2014":0,"FY 2015":0,"FY 2016":0}},"cumulative_funding":{"funding_by_phase":{"(01) Design":{"FY 2011":{"allotted":0,"spent":0,"proposed":1000}}},"funding_by_source":{"GO Bonds - New (0300)":{"FY 2011":{"allotted":0,"spent":0,"proposed":1000}}},"total_funding":{"FY 2011":{"allotted":0,"spent":0,"proposed":1000}}}}